---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.Roughness
source: html/5b089154-9759-741e-e5ed-877a093e8c74.htm
---
# Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.Roughness Property

The roughness of this segment, in ft.

## Syntax (C#)
```csharp
public double Roughness { get; }
```